verilog_defaults -push
verilog_defaults -add -defer
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/Descargas/I2S/rd1101/source/verilog/i2s_codec.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_cpu.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_instruction_unit.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_decoder.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_load_store_unit.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_adder.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_addsub.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_logic_op.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_shifter.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_multiplier.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_mc_arithmetic.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_interrupt.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_ram.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_dp_ram.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_icache.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_dcache.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_debug.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_itlb.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_dtlb.v
read_verilog -I/home/johan/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/johan/litex/litex/soc/cores/cpu/lm32/verilog/config /home/johan/Descargas/I2S/rd1101/source/build/gateware/board_75e.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top board_75e
write_json  board_75e.json